# 4.9 Task 1

This script contains the following points:
1. Import data and libraries
2. Import dataframes
3. Check output of df_customers and ords_prods_merge
4. Data wrangling of df_customers
5. Data consistency checks of df_customers
6. Combine df_customers with ords_prods_merge

#### Task #3: Import your analysis libraries, as well as your new customer data set as a dataframe

## 1. Import data and libraries

In [5]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

## 2. Import dataframes

In [7]:
path = r'C:\Users\Barb\07-2024 Instacart Basket Analysis'

In [8]:
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original', 'customers.csv'), index_col = False)

In [9]:
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared', 'ords_prods_merge_4.8.pkl'))

## 3. Check output

In [11]:
ords_prods_merge.shape

(30328763, 23)

In [12]:
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,hour_time_of_order,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spent,spending_flag,buy_frequency,frequency_flag
0,2398795,1,2,3,7,15.0,196,1,1,Soda,...,NaN,Regularly busy,Slowest days,Average Orders,10,New customer,6.372222,Low spender,20.259259,Non-frequent customer
1,2398795,1,2,3,7,15.0,10258,2,0,Pistachios,...,Low-range product,Regularly busy,Slowest days,Average Orders,10,New customer,6.372222,Low spender,20.259259,Non-frequent customer
2,2398795,1,2,3,7,15.0,12427,3,1,Original Beef Jerky,...,Low-range product,Regularly busy,Slowest days,Average Orders,10,New customer,6.372222,Low spender,20.259259,Non-frequent customer
3,2398795,1,2,3,7,15.0,13176,4,0,Bag of Organic Bananas,...,NaN,Regularly busy,Slowest days,Average Orders,10,New customer,6.372222,Low spender,20.259259,Non-frequent customer
4,2398795,1,2,3,7,15.0,26088,5,1,Aged White Cheddar Popcorn,...,Low-range product,Regularly busy,Slowest days,Average Orders,10,New customer,6.372222,Low spender,20.259259,Non-frequent customer

In [13]:
df_customers.shape

(206209, 10)

In [14]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## 4. Data wrangling of df_customers (new df)

#### Task #4 Wrangle the data so that is follows consistent logic; for example, rename columns with illogical names and drop columns that don't add anything to your analysis

### 4.1 Rename columns from df_customers with illogical names

In [18]:
#Rename Surnam column
df_customers.rename(columns = {'First Name': 'first_name',
                               'Surnam': 'last_name',
                               'Gender': 'gender',
                               'STATE': 'state',
                               'Age': 'age',
                               'n_dependants': 'number_of_dependents',
                              'fam_status': 'marriage_status'},
                              inplace = True)

In [19]:
df_customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependents,marriage_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### 4.2 Drop unnecessary columns from df_customers

In [21]:
# No need to drop any columns

## 5. Data consistency in customers_df?

#### Task #5. Complete the fundamental data quality and consistency checks

### 5.1 Mixed-type data in df_customers?

In [25]:
for col in df_customers.columns.tolist():
    weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_customers[weird]) > 0:
        print(col)

first_name

### 5.2 Check data type

In [27]:
df_customers.info() #check data type for all columns in df 
#Mixed-type data occurs when multiple data types exist in the same column.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   first_name            194950 non-null  object
 2   last_name             206209 non-null  object
 3   gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int64
 6   date_joined           206209 non-null  object
 7   number_of_dependents  206209 non-null  int64
 8   marriage_status       206209 non-null  object
 9   income                206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

#### 5.2.2 Change data type

In [29]:
#change data type of 'user_id' to a string (or object) - a data type the command decribe() will ignore

In [30]:
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [31]:
df_customers['user_id'].dtype

dtype('O')

### 5.3 Missing Values in customers_df?

In [33]:
df_customers.isnull().sum()

user_id                     0
first_name              11259
last_name                   0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependents        0
marriage_status             0
income                      0
dtype: int64

In [34]:
#Create missing values df (df_nan) to view these 11,259 missing values

In [35]:
df_nan = df_customers[df_customers['first_name'].isnull() == True]

In [36]:
df_nan.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependents,marriage_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819

#### 5.3.1 Removing missing values? Decided not to remove first names

In [38]:
#To check your work, use following equation
# (Entire df with Missing values) - (Missing values df - df_nan) = Entire df w/o missing values 
#1st, find out rows of entire df with missing values NaN
#df_customers.shape

In [39]:
#create a new dataframe w/o the missing values - df_customers_clean

In [40]:
#df_customers_clean = df_customers[df_customers['first_name'].isnull() == False]

In [41]:
#df_customers_clean.shape

### 5.4 Duplicates in df_customers_clean?

In [43]:
#ID all full duplicates within your dataframe

In [44]:
#find out # of rows and columns with missing values

In [45]:
df_dups = df_customers[df_customers.duplicated()]

In [46]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependents, marriage_status, income]
Index: []

#### There are no duplicates in df_customers

## 6. Combine df_customers_clean with ords_prods_merge

#### Task #6. Combine df_customers_clean w/ rest of your prepared Instacart data. (Hint: make sure key columns are same data type.)

### 6.1 Make sure 'user_id' is same data type for both df_customers and ords_prods_merge

In [51]:
#line 148 - df_customers 'user_id' is object data type

In [52]:
# Find data type of 'user_id' for ords_prods_merge

In [53]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30328763 entries, 0 to 30328762
Data columns (total 23 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   orders_day_of_week      int64
 4   hour_time_of_order      int64
 5   days_since_prior_order  float64
 6   product_id              int64
 7   add_to_cart_order       int64
 8   reordered               int64
 9   product_name            object
 10  aisle_id                int64
 11  department_id           int64
 12  prices                  float64
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_days            object
 16  busiest_period_of_day   object
 17  max_order               int64
 18  loyalty_flag            object
 19  avg_spent               float64
 20  spending_flag           object
 21  buy_frequency           float64
 22  frequency_flag          object
dtypes: float64(4), int64(11), object(8)
memory usage: 5.2+ GB

In [54]:
#change data type of 'order_id' and 'user_id' to a string (or object) - a data type the command decribe() will ignore

In [55]:
ords_prods_merge['order_id'] = ords_prods_merge['order_id'].astype('str')

In [56]:
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [57]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30328763 entries, 0 to 30328762
Data columns (total 23 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   order_number            int64
 3   orders_day_of_week      int64
 4   hour_time_of_order      int64
 5   days_since_prior_order  float64
 6   product_id              int64
 7   add_to_cart_order       int64
 8   reordered               int64
 9   product_name            object
 10  aisle_id                int64
 11  department_id           int64
 12  prices                  float64
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_days            object
 16  busiest_period_of_day   object
 17  max_order               int64
 18  loyalty_flag            object
 19  avg_spent               float64
 20  spending_flag           object
 21  buy_frequency           float64
 22  frequency_flag          object
dtypes: float64(4), int64(9), object(10)
memory usage: 5.2+ GB

### 6.2 Check for full match in merge

In [59]:
#Check for full match by using Indicator=True argument

In [60]:
df_customers_ords_prods_merge = df_customers.merge(ords_prods_merge, on = 'user_id', indicator = True)

In [61]:
df_customers_ords_prods_merge.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependents,marriage_status,income,...,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_spent,spending_flag,buy_frequency,frequency_flag,_merge
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regularly busy,Regularly busy,Average Orders,8,New customer,8.205882,Low spender,19.823529,Regular customer,both
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regularly busy,Slowest days,Most Orders,8,New customer,8.205882,Low spender,19.823529,Regular customer,both
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regularly busy,Slowest days,Most Orders,8,New customer,8.205882,Low spender,19.823529,Regular customer,both
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regularly busy,Slowest days,Most Orders,8,New customer,8.205882,Low spender,19.823529,Regular customer,both
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,Regularly busy,Busiest days,Average Orders,8,New customer,8.205882,Low spender,19.823529,Regular customer,both

#### Task #8. Export this new dataframe as a pickle file

In [63]:
# Check shape before exporting
df_customers_ords_prods_merge.shape

(30328763, 33)

In [64]:
#Export the updated dataframe as a pickle file
df_customers_ords_prods_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared', 'ords_prods_all.pkl'))